# =-=-=-=- {import space} =-=-=-=-  
import matplotlib.pyplot as plt
import numpy as np

# მონაცემები
temp_off = [
    32.8, 32.4, 31.8, 32.7, 33.0, 32.7, 32.0, 32.8, 33.0, 32.7, 32.2,
    33.0, 33.1, 32.6, 32.7, 33.2, 33.0, 32.5, 31.7, 32.3, 32.4
]
temp_on = [
    20.3, 21.1, 22.5, 23.0, 24.4, 25.8, 27.0, 27.9, 28.6, 29.2, 29.8,
    30.3, 30.8, 31.1, 31.5, 31.8, 32.1, 32.4, 31.5, 31.0, 31.1, 31.5,
    32.1, 31.2, 31.1, 31.6, 32.2, 31.3, 31.2, 31.7, 32.4, 31.9, 31.2,
    32.3, 32.0, 31.8, 31.2, 31.5, 31.2
]
temp = [
    20.3, 21.1, 22.5, 23.0, 24.4, 25.8, 27.0, 27.9, 28.6, 29.2, 29.8, 30.3, 30.8,
    31.1, 31.5, 31.8, 32.1, 32.4, 32.8, 32.4, 31.8, 31.5, 31.0, 31.1, 31.5, 32.1,
    32.7, 33.0, 32.7, 32.0, 31.2, 31.1, 31.6, 32.2, 32.8, 33.0, 32.7, 32.2, 31.3,
    31.2, 31.7, 32.4, 33.0, 33.1, 32.6, 31.9, 31.2, 32.3, 32.0, 32.7, 33.2, 33.0,
    32.5, 31.8, 31.2, 31.5, 31.2, 31.7, 32.3, 32.4
]


time_off = np.arange(len(temp_off))  
time_on = np.arange(len(temp_on))   
time_all = np.arange(len(temp))    

# გრაფიკი
plt.figure(figsize=(14, 7))
plt.plot(time_off, temp_off, label="ტემპერატურა (გათიშული)", color="red", linestyle='--')
plt.plot(time_on, temp_on, label="ტემპერატურა (ჩართული)", color="green", linestyle='-')
plt.plot(time_all, temp, label="მიმდინარეობის ტემპერატურა", color="blue", linestyle='-.')

# სეთთინგი
plt.title("ტემპერატურის ცვალებადობის გრაფიკი", fontsize=16)
plt.xlabel("დრო (∆ წუთი)", fontsize=14)
plt.ylabel("ტემპერატურა (°C)", fontsize=14)
plt.grid(True, linestyle='--', alpha=0.5)
plt.legend(fontsize=12)
plt.show()

